# -*- coding: utf-8 -*-
"""
Created on Thu Dec  6 12:01:17 2018

@author: kosmo
"""
# F5 전체
# 드래그, ctrl + enter 부분

# 기초 -------------------------------------------------------------

a = 24
print(a)

print( 2 + 4 )

# 연산자 -----------------------------------------------------------
print( 7 / 4 )
print( 7 // 4)
print(7 % 4)

# 변수 -------------------------------------------------------------
한글 = 3
print(한글)
c = 3
print("c=", c)
print("한글 + c =", 한글 + c)

# 제어문 -----------------------------------------------------------
for x in range(10):
    print("number :", x)
    
# range -----------------------------------------------------------
list(range(5))
list(range(1, 5))

for x in range(1, 4):
    print("number :", x)
print("Hello, end")
